app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = ? AND "devices"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def show
    @device = current_user.devices.find(params[:id])

INSERT INTO "devices" ("name", "mac_address", "feed_id", "user_id", "created_at", "updated_at", "state") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @device = current_user.devices.new(device_params)
    if @device.save

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = ? AND "devices"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @device = current_user.devices.find(params[:id])

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = ? AND "devices"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "devices" SET "updated_at" = ?, "state" = ? WHERE "devices"."id" = ?  [["updated_at", "2024-06-02 12:07:03.557443"], ["state", "on"], ["id", 2]]
---
  def update
    @device = current_user.devices.find(params[:id])
    if @device.update(device_params)

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = ? AND "devices"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "devices" WHERE "devices"."id" = ?  [["id", 2]]
---
  def destroy
    @device = current_user.devices.find(params[:id])
    unbind_device_from_adafruit_io(@device)
    @device.destroy

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = ? AND "devices"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "devices" SET "updated_at" = ?, "state" = ? WHERE "devices"."id" = ?  [["updated_at", "2024-06-02 11:57:42.461238"], ["state", "off"], ["id", 2]]
---
  def toggle_state
    @device = current_user.devices.find(params[:id])
    new_state = @device.state == "on" ? "off" : "on"
    @device.update(state: new_state)

UPDATE "devices" SET "feed_id" = ?, "updated_at" = ? WHERE "devices"."id" = ?  [["feed_id", "2823548"], ["updated_at", "2024-06-02 13:09:18.266554"], ["id", 3]]
---
  def bind_device_to_adafruit_io(device)
    require 'rest-client'

    api_url = "https://io.adafruit.com/api/v2/QueXu/feeds"
    api_key = "aio_prGk59hr3knUASMLeSOEDD9kpHJx"

    payload = {
      feed: {
        name: device.mac_address,
        description: device.name
      }
    }

    headers = {
      'X-AIO-Key': api_key,
      content_type: :json,
      accept: :json
    }

    response = RestClient.post(api_url, payload.to_json, headers)
    json_response = JSON.parse(response.body)
    device.update(feed_id: json_response['id'])